
_tmp_calender = {
	weekend =  -- 2 ngµy cuèi tuÇn, ®Êu 8 trËn, tõ 18h~19h ®Õn 19~20h
	{
		{18*60, 4},	
		{19*60, 4},
	},
	common = -- c¸c ngµy ®Çu tuÇn tõ thø 2 ®Õn thø 6
	{	
		-- {19*60, 4}, 
		{18*60, 4}, 
		
		
		-------------------------------------------------------------------
		-- {16*60, 4}, 
		-- {17*60, 4},	
		-------------------------------------------------------------------
	}
}

--Èü¼¾°²ÅÅ
-- ÀàÐÍ£º1¡¢Ë«ÈË£»2¡¢ÃÅÅÉ£»3¡¢Ê¦Í½£»4¡¢ÈýÈË£»5¡¢»ìºÏµ¥ÈË£»6¡¢Í¬ÏµË«ÈË£»7¡¢»ìºÏË«ÈË
WLLS_SEASON_TB = {
	-- [ID]={ÀàÐÍ, 	¿ªÊ¼ÈÕÆÚ,	½áÊøÈÕÆÚ,	²ÎÈü´ÎÊý,	ÈÕ³Ì°²ÅÅ}
	[0] = {2,		0,			0,			0,			{}},	--¿ÕÈü¼¾£¬¼«¶ËÇé¿ö±£»¤
	
	-- 14ÄêÁªÈü
--[SeasonID]=
       --{n_ntype,
				     --Begin Day,	End Day,	T?ng tr?n,	ÈÕ³Ì°²ÅÅ}
	[40] = {2,		140108,		100128,		48,		_tmp_calender},
	[41] = {5,		140208,		140228,		48,		_tmp_calender},
	[42] = {5,		130308,		130328,		48,		_tmp_calender},
	[43] = {5,		140408,		140428,		48,		_tmp_calender},
	[44] = {5,		140508,		140528,		48,		_tmp_calender},
	[45] = {5,		140608,		140628,		48,		_tmp_calender},
	[46] = {5,		140708,		140728,		48,		_tmp_calender},
	[47] = {5,		140808,		140828,		48,		_tmp_calender},
	[48] = {5,		140908,		140928,		48,		_tmp_calender},
	[49] = {5,		141008,		141028,		48,		_tmp_calender},
	[50] = {5,		141108,		141128,		48,		_tmp_calender},
	[51] = {5,		141208,		141228,		48,		_tmp_calender},
	
	-- 15ÄêÁªÈü
	[52] = {5,		150108,		150128,		48,		_tmp_calender},
	[53] = {1,		150208,		150228,		48,		_tmp_calender},
	[54] = {2,		150308,		150328,		48,		_tmp_calender},
	[55] = {4,		150408,		150428,		48,		_tmp_calender},
	[56] = {1,		150508,		150528,		48,		_tmp_calender},
	[57] = {4,		150608,		150628,		48,		_tmp_calender},
	[58] = {5,		150708,		150728,		48,		_tmp_calender},
	[59] = {5,		150808,		150828,		48,		_tmp_calender},
	[60] = {5,		150908,		150928,		48,		_tmp_calender},
	[61] = {5,		151008,		151028,		48,		_tmp_calender},
	[62] = {5,		151108,		151128,		48,		_tmp_calender},
	[63] = {5,		151208,		151228,		48,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2017
	[64] = {5,		170101,		170128,		120,		_tmp_calender},
	[65] = {5,		170201,		170228,		120,		_tmp_calender},
	[66] = {5,		170301,		170328,		120,		_tmp_calender},
	[67] = {5,		170401,		170428,		120,		_tmp_calender},
	[68] = {5,		170501,		170528,		120,		_tmp_calender},
	[69] = {5,		170601,		170628,		120,		_tmp_calender},
	[70] = {5,		170701,		170728,		120,		_tmp_calender},
	[71] = {5,		170801,		170828,		120,		_tmp_calender},
	[72] = {5,		170901,		170928,		120,		_tmp_calender},
	[73] = {5,		171001,		171028,		120,		_tmp_calender},
	[74] = {5,		171101,		171128,		120,		_tmp_calender},
	[75] = {5,		171201,		171228,		120,		_tmp_calender},
	
	-- Update lÞch cho n¨m 2018
	[76] = {5,		180101,		180128,		120,		_tmp_calender},
	[77] = {5,		180201,		180228,		120,		_tmp_calender},
	[78] = {5,		180301,		180328,		120,		_tmp_calender},
	[79] = {5,		180401,		180428,		120,		_tmp_calender},
	[80] = {5,		180501,		180528,		120,		_tmp_calender},
	[81] = {5,		180601,		180628,		120,		_tmp_calender},
	[82] = {5,		180701,		180728,		120,		_tmp_calender},
	[83] = {5,		180808,		180828,		120,		_tmp_calender},
	[84] = {5,		180908,		180928,		120,		_tmp_calender},
	[85] = {5,		181008,		181028,		120,		_tmp_calender},
	[86] = {5,		181108,		181128,		120,		_tmp_calender},
	[87] = {5,		181208,		181228,		120,		_tmp_calender},
}

--½áÎ²Á½¸ö¿ÕÈü¼¾±ÜÃâ¼«¶ËÇé¿ö
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999998,	999998,	0,	_tmp_calender}
WLLS_SEASON_TB[getn(WLLS_SEASON_TB)+1] = {2,	999999,	999999,	0,	_tmp_calender}

